; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	thermograph0 - mode
	image1 - mode
	Star0 - direction
	GroundStation6 - direction
	GroundStation10 - direction
	Star5 - direction
	GroundStation8 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation11 - direction
	GroundStation9 - direction
	GroundStation1 - direction
	Star7 - direction
	GroundStation4 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation8)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon14)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation9)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation9)
)
(:goal (and
	(pointing satellite1 Star5)
	(pointing satellite2 GroundStation10)
	(pointing satellite3 Phenomenon13)
	(pointing satellite4 Star0)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 image1)
	(have_image Phenomenon14 image1)
	(have_image Star15 image1)
	(have_image Planet16 image1)
))

)

; plan
1. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 9
2. (calibrate satellite3 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 9
3. (turn_to satellite3 phenomenon14 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon14)
   goals met: 0 of 9
4. (take_image satellite3 phenomenon14 instrument3 image1)
   added: (have_image phenomenon14 image1)
   goals met: 1 of 9
5. (turn_to satellite3 phenomenon12 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon12)
   goals met: 1 of 9
6. (turn_to satellite2 groundstation10 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 groundstation10)
   goals met: 2 of 9
7. (turn_to satellite1 star5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star5)
   goals met: 3 of 9
8. (take_image satellite3 phenomenon12 instrument3 image1)
   added: (have_image phenomenon12 image1)
   goals met: 4 of 9
9. (turn_to satellite3 planet16 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 planet16)
   goals met: 4 of 9
10. (take_image satellite3 planet16 instrument3 image1)
   added: (have_image planet16 image1)
   goals met: 5 of 9
11. (turn_to satellite3 star15 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 star15)
   goals met: 5 of 9
12. (take_image satellite3 star15 instrument3 image1)
   added: (have_image star15 image1)
   goals met: 6 of 9
13. (turn_to satellite3 phenomenon13 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 phenomenon13)
   goals met: 7 of 9
14. (take_image satellite3 phenomenon13 instrument3 image1)
   added: (have_image phenomenon13 image1)
   goals met: 8 of 9
15. (turn_to satellite4 star0 groundstation9)
   deleted: (pointing satellite4 groundstation9)
   added: (pointing satellite4 star0)
   goals met: 9 of 9
